%双谱线插值初始版，用于求必做基波及谐波的平均频率、幅值、相位
clc;clear;close all;

wave = csvread('1_1.csv'); %load 数据
s=wave(1:3500,2);%由于在4800点前后会有幅值、频率阶跃，故不能直接对全部信号进行FFT，先截取前4500个点分析
fs=10000; %采样率
N=length(s);%采样点数
n=0:N-1;
M = 23;
w=0.5-0.5*cos(2*pi*(n)/N);%汉宁窗
r=s.*w';%对原信号加窗，信号乘以窗函数
v=fft(r,N);%进行FFT，返回N点的DFT
fuzhi=abs(v)/N*2*2;%求幅值并修正，修正系数为2
u=abs(v);
stem(fuzhi);%绘制出FFT后离散信号的茎状图，用于判断k0、k1、k2
A=zeros(1,30);%存储幅值
F=zeros(1,30);%存储频率
P=zeros(1,30);%存储相位
cishu=zeros(1,30);%存储次数

%以下为双峰谱线插值修正算法
for ii=0:29 %I+1对应谐波系数，题目说明只含有小于30次的谐波，故在29截止即可
    if(u(M - 1 + (M-1)*(ii)) > u(M + 1 + (M-1)*(ii)))
        k1 = M - 1 + (M-1)*(ii);
        k2 = M + (M-1)*(ii);
    else 
        k1 = M + (M-1)*(ii);
        k2 = M + 1 + (M-1)*(ii);
    end
    y1 = u(k1);
    y2 = u(k2);
    b=(y2-y1)/(y2+y1);%相当于参考文献中的参数β
    a=1.5*b;%相当于参考文献中的参数α
    k0=k1+a+0.5-1;%峰值频率
    A(ii+1)=(y1+y2)*(2.35619403+1.15543628*a^2+0.32607873*a^4+0.07891461*a^6)/N;%修正后的幅值
    F(ii+1)=k0*fs/N; %频率不需要修正，
    P(ii+1)=(angle(v(M+1+6*ii))+pi/2-pi*(a-(-1)*0.5))/pi*180;
end

for i=1:29
    for j=1:29
         if (F(i)/F(1)>=j*0.98) && (F(i)/F(1)<=j*1.02)% 只有误差在基波频率的j倍的98%-102%以内才算谐波
             cishu(i)=j;
         end
    end
end
total=[cishu;A;F;P];
display(A);
display(F);
